snlkuharlocal/src/DataProcessors/ОбменДаннымиТП/ОбменДаннымиТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменДаннымиТП</name>
  <attributes>
    <name>СерверFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>ExchangePlanRef.Основной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыСообщенийЛога/ТипыСообщенийЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийЛога</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ОбменДаннымиТП/ObjectModule.bsl
Перем Соединение,НастройкиОбмена,СтрНастроек,ОбработкаОбменаДаннымиXML;

Процедура Сообщить1(стр) экспорт
	 
	#ЕСЛИ КЛИЕНТ ТОГДА
    Сообщить(стр);
	ЗаписатьВЛог("Выгрузка данных ТП",стр,Перечисления.ТипыСообщенийЛога.Информация); 
 	#ИНАЧЕ
	ЗаписатьВЛог("Выгрузка данных ТП",стр,Перечисления.ТипыСообщенийЛога.Информация); 
	#КОНЕЦЕСЛИ
    		 
 Конецпроцедуры


Функция СформироватьИмяКонфигурацииДляОтображенияПользователю(СтруктураКонвертации, ИмяОпределения)
	
	ИмяКонфигурации = "";
	СтруктураКонвертации.Свойство("СинонимКонфигурации" + ИмяОпределения + "а", ИмяКонфигурации);	
	Если Не ЗначениеЗаполнено(ИмяКонфигурации) Тогда
		СтруктураКонвертации.Свойство(ИмяОпределения, ИмяКонфигурации);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяКонфигурации) Тогда
		Возврат "";
	КонецЕсли;
	
	ТочнаяВерсия = "";
	СтруктураКонвертации.Свойство("ВерсияКонфигурации" + ИмяОпределения + "а", ТочнаяВерсия);
	
	Если ЗначениеЗаполнено(ТочнаяВерсия) Тогда
		ИмяКонфигурации = ИмяКонфигурации + " (" + ТочнаяВерсия + ")";
	КонецЕсли;
	
	Возврат ИмяКонфигурации;
		
КонецФункции	

Функция ПолучитьПоНастройкеОбменаИнформациюОПравилах(НастройкиОбмена, ЭтоВыгрузкаИзТекущейИБ = Истина) Экспорт
	
	попытка		
			
		ОбработкаОбменаДаннымиXML.РежимОбмена = "Выгрузка";
		
		// загружаем только заголовок правил
		ОбработкаОбменаДаннымиXML.ЗагрузитьПравилаОбмена(НастройкиОбмена.ТекстПравил, "Строка");
		
		ИмяИсточника = СформироватьИмяКонфигурацииДляОтображенияПользователю(ОбработкаОбменаДаннымиXML.Конвертация, "Источник");
		ИмяПриемника = СформироватьИмяКонфигурацииДляОтображенияПользователю(ОбработкаОбменаДаннымиXML.Конвертация, "Приемник");
		
		// нужно сформировать строку для каких конфигураций предназначены правила обмена
		Если Не ПустаяСтрока(ИмяИсточника) 
			И Не ПустаяСтрока(ИмяПриемника) Тогда
			
			Возврат "Правила обмена для выгрузки из """ + ИмяИсточника + """ и загрузки в """ + ИмяПриемника + """";
			
		КонецЕсли;
		
		Возврат "Нет данных о конфигурациях правил обмена";
		
	 Исключение
			
		// в режиме клиента выводим информацию об ошибке
		Сообщить1("Ошибка при получении информации о правилах обмена: " + ОписаниеОшибки());
						   
	КонецПопытки;
		
КонецФункции	
					
// функция выполняет FTP подключение к серверу
Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
	#КонецЕсли
    
	Попытка
		
		// если есть пользователь прокси сервера, то подключаемся чере прокси
		Если Не ПустаяСтрока(НастройкиОбмена.ПользовательПроксиFTP)
			ИЛИ НЕ ПустаяСтрока(НастройкиОбмена.ПротоколПроксиFTP)
			ИЛИ НЕ ПустаяСтрока(НастройкиОбмена.СерверПроксиFTP) Тогда
			
			ИмяПротокола = Врег(СокрЛП(НастройкиОбмена.ПротоколПроксиFTP));
			Если ИмяПротокола <> "" Тогда
				
				Если НЕ (ИмяПротокола = "HTTP" ИЛИ ИмяПротокола = "HTTPS" ИЛИ ИмяПротокола = "FTP") Тогда
					
					Сообщить1("Указан не допустимый для использования протокол. 
						|Допустимые для использования протоколы прокси-сервера: http, https и ftp."+ 
						ДанныеПротокола);
					Возврат Неопределено;
						
				КонецЕсли;
				
			КонецЕсли;			
			
			ПроксиСервер = Новый ИнтернетПрокси;
			ПроксиСервер.Пользователь = НастройкиОбмена.ПользовательПроксиFTP;
			ПроксиСервер.Пароль = НастройкиОбмена.ПарольПроксиFTP;
			
			ПроксиСервер.Установить(НастройкиОбмена.ПротоколПроксиFTP, НастройкиОбмена.СерверПроксиFTP, НастройкиОбмена.ПортПроксиFTP); 
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
				НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ПроксиСервер, НастройкиОбмена.ПассивноеFTPСоединение);
			
		Иначе
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
				НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ,НастройкиОбмена.ПассивноеFTPСоединение);
						
		КонецЕсли;			
			
	Исключение
			
		// ошибка при подключении к ftp
		Сообщить1("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

Процедура сформировать(ТаблицаПараметров2=Неопределено) экспорт
	
	Если НЕ (Узлы.Количество()>0 и Склады.Количество()>0) тогда
		Если ТаблицаПараметров2<>Неопределено Тогда
			Для Каждого СтрокаТП ИЗ ТаблицаПараметров2 Цикл
				//ЗаписатьВЛог("ЗапускОтчетов",""+СтрокаТП.Имя+". ","Информация");
				
				Если СтрокаТП.Имя="Узел" Тогда
					нов=узлы.Добавить();
					нов.Узел=(СтрокаТП.Значение);
				Конецесли;
				
				Если СтрокаТП.Имя="Склад" Тогда
					нов=Склады.Добавить();
					нов.Склад=(СтрокаТП.Значение);
					//ЗаписатьВЛог("ЗапускОтчетов",""+СтрокаТП.Значение+". ","Информация");

				Конецесли;
				
				Если СтрокаТП.Имя="ВсеТовары" Тогда
					ВсеТовары=(СтрокаТП.Значение);
				Конецесли;
			КонецЦикла;			
		Конецесли;
	Конецесли;
	//сообщить1("Склад="+Склады[0].Склад);
	КнопкаВыгрузить();
	
Конецпроцедуры

Процедура КнопкаВыгрузить(Кнопка=неопределено)
		
    //Выгружаем общее
	//ЗадатьНастройки();
	//Если НЕ СтрНастроек.ПроизводитьЗаписьДанных тогда
	//	возврат;
	//Конецесли;	
	//
	//ИмяфайлаОбмена=КаталогВременныхФайлов()+СтрНастроек.ИмяФайлаЗаписиИзменений+".xml";
	//ИмяфайлаАрхива=КаталогВременныхФайлов()+СтрНастроек.ИмяФайлаЗаписиИзменений+".zip";
	//Элементыформы.ИнформацияОПравилах.Значение=ПолучитьПоНастройкеОбменаИнформациюОПравилах(СтрНастроек);
	//ОбработкаОбменаДаннымиXML.ИмяФайлаПравилОбмена="1";
	//ОбработкаОбменаДаннымиXML.таблицанастройкипараметров.Очистить();
	//для каждого стр из СтрНастроек.ТаблицаПараметров цикл
	//	нов=ОбработкаОбменаДаннымиXML.таблицанастройкипараметров.добавить();
	//	Заполнитьзначениясвойств(нов,Стр);
	//Конеццикла;	

	//ОбработкаОбменаДаннымиXML.ИмяФайлаОбмена=ИмяфайлаОбмена;
	//ОбработкаОбменаДаннымиXML.ВыполнитьВыгрузку();
	//заархивироватьфайл2(ИмяфайлаОбмена,ИмяФайлаАрхива);
	//КопироватьФайл2(ИмяфайлаАрхива,ПолучитьСтрокуОтделеннойСимволом(ИмяфайлаАрхива,"\"),Соединение,ИСТИНА);
	//Сообщить("Выгружено общее для всех узлов...");
    

	//для каждого стр1 из узлы цикл 
	
	ЗадатьНастройки(); //Стр1.Узел.код 
	
	Если НЕ СтрНастроек.ПроизводитьЗаписьДанных тогда
		возврат;
	Конецесли;	
	
	для ном=0 по 50 цикл
		
		Если ном=0 тогда	
			сим="";
		иначе 
			сим=ном;
		конецесли;
		
		ИмяфайлаОбмена=КаталогВременныхФайлов()+СтрНастроек.ИмяФайлаЗаписиИзменений+сим+".xml";
		ИмяфайлаАрхива=КаталогВременныхФайлов()+СтрНастроек.ИмяФайлаЗаписиИзменений+сим+".zip";
		
		попытка
			
			файл2 = Новый Файл(ИмяфайлаОбмена);
			Если Файл2.Существует() Тогда
				Удалитьфайлы(ИмяфайлаОбмена);
			Конецесли;
			
			файл2 = Новый Файл(ИмяфайлаАрхива);
			Если Файл2.Существует() Тогда
				Удалитьфайлы(ИмяфайлаАрхива);
			Конецесли;
			
			Залочено=ЛОЖЬ;
			
		исключение
			Залочено=ИСТИНА;
		конецпопытки;
		
		Если Залочено тогда
			продолжить;
		Конецесли;
		
		прервать;
	Конеццикла;	
	
	//сообщить1("!!!="+ИмяфайлаОбмена);
	знач1=ПолучитьПоНастройкеОбменаИнформациюОПравилах(СтрНастроек);
	ОбработкаОбменаДаннымиXML.ИмяФайлаПравилОбмена="1";
	ОбработкаОбменаДаннымиXML.таблицанастройкипараметров.Очистить();
	для каждого стр из СтрНастроек.ТаблицаПараметров цикл
		нов=ОбработкаОбменаДаннымиXML.таблицанастройкипараметров.добавить();
		Заполнитьзначениясвойств(нов,Стр);
	//	Сообщить1("Имя="+стр.имя+" значение="+стр.значение);
	Конеццикла;	

	ОбработкаОбменаДаннымиXML.ИмяФайлаОбмена=ИмяфайлаОбмена;
	ОбработкаОбменаДаннымиXML.ВыполнитьВыгрузку();
	// Сообщить1("!!!="+ИмяфайлаАрхива);
	заархивироватьфайл2(ИмяфайлаОбмена,ИмяФайлаАрхива);
	
	КопироватьФайл2(ИмяфайлаАрхива,ПолучитьСтрокуОтделеннойСимволом(ИмяфайлаАрхива,"\"),Соединение,ИСТИНА);
//	Сообщить1("Выгружено...");
//Конеццикла;	
КонецПроцедуры

                    
Процедура КнопкаЗагрузить(Кнопка=НЕОПРЕДЕЛЕНО) Экспорт
	
	ЗадатьНастройки();
    Если НЕ СтрНастроек.ПроизводитьЧтениеДанных тогда
		возврат;
	Конецесли;
	
	ИмяфайлаОбмена=КаталогВременныхФайлов()+"\in.zip";

	для каждого стр из узлы цикл
		МассивФайлов=Соединение.найтифайлы("",СтрНастроек.ИмяФайлаЧтенияИзменений+Сокрлп(стр.узел.код)+"*");
		Для каждого файл1 из МассивФайлов цикл
			Сообщить1("Обработка "+файл1.имя);
			СтрНастроек.ИмяФайлаЧтенияИзменений=файл1.Имя;
			КопироватьФайл2(файл1.Имя,ИмяФайлаОбмена,Соединение,Ложь);
			ИмяФайлаXML=РазархивироватьФайл2(ИмяФайлаОбмена);
			ОбработкаОбменаДаннымиXML.файлобмена=ИмяФайлаXML;
			ОбработкаОбменаДаннымиXML.ИмяФайлаОбмена=ИмяФайлаXML;
			ОбработкаОбменаДаннымиXML.РежимОбмена = "Загрузка";
			ОбработкаОбменаДаннымиXML.ВыполнитьЗагрузку();
			//Удалитьфайлы(ИмяфайлаОбмена);
			Удалитьфайлы(ИмяфайлаXML);
			соединение.Удалить(файл1.имя);
		Конеццикла;
	Конеццикла;
	
		
КонецПроцедуры

функция КопироватьФайл2(ИмяФайлаИсточника,ИмяФайлаПриемника,СоединениеFTP=Неопределено,НаFTP=Истина)
	Если СоединениеFTP=Неопределено тогда
	Копироватьфайл(ИмяФайлаИсточника,ИмяФайлаПриемника);
	иначе
	ИмяФайлаПриемника1=СтрЗаменить(ИмяФайлаПриемника,"\","/");
	ИмяФайлаИсточника1=СтрЗаменить(ИмяФайлаИсточника,"\","/");
	Если НаFTP тогда
	СоединениеFTP.Записать(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	иначе
	СоединениеFTP.Получить(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	Конецесли;
	Конецесли;
Конецфункции

///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ	
	
 
Функция ОпределитьНовоеИмяКаталогаДляОбменаДанными() Экспорт
	
	ВременныйКаталог = КаталогВременныхФайлов();
	
	НомерКаталога = 1;
	Пока НомерКаталога <= 1000 Цикл
		
		ОчередноеИмяКаталога = ВременныйКаталог + "Каталог обмена " + СтрЗаменить(Строка(НомерКаталога), Символы.НПП, "");
		
		ВыбФайл = Новый Файл(ОчередноеИмяКаталога);
		Если НЕ ВыбФайл.Существует() Тогда
			Возврат ОчередноеИмяКаталога;
		КонецЕсли;
				
		НомерКаталога = НомерКаталога + 1;	
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьСтрокуОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат "";
  	
КонецФункции


// Выделяет из имени файла его расширение (набор символов после последней точки).
//
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция ПолучитьРасширениеИмениФайла(Знач ИмяФайла) Экспорт
	
	Расширение = ПолучитьСтрокуОтделеннойСимволом(ИмяФайла, ".");
	Возврат Расширение;
	
КонецФункции

//ФОРМА ХОДА ОБРАБОТКИ

// функция по текущей дате возвращает имя дня недели
Функция ПолучитьИмяДняНедели(Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		НомерДняДенели = ДеньНедели(ТекущаяДата());
	Иначе
		НомерДняДенели = ДеньНедели(Дата);
    КонецЕсли;
	
	Если НомерДняДенели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняДенели = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДняДенели = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДняДенели = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДняДенели = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДняДенели = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";	
	КонецЕсли;
	
КонецФункции

// функция нормализует ftp адрес (отрезает не нужное)
Функция НормализоватьFTPАдрес(Знач FTPАдрес) Экспорт
	
	ИтоговыйАдрес = СокрЛП(FTPАдрес);
	ПозицияFTP = Найти(Врег(ИтоговыйАдрес), "FTP://");
	
	Если ПозицияFTP = 1 Тогда
		
		ИтоговыйАдрес = Сред(ИтоговыйАдрес, 7);	
		
	КонецЕсли;
	
	Возврат ИтоговыйАдрес;
	
КонецФункции
 
//// Процедура по полному пути к файлу определяет каталог файла и есл каталог отсутвует то создает его
//Процедура СоздатьКаталогПоПолномуПутиКФайлу(Знач ПолноеИмяФайла)
//	
//	ИмяКаталога = "";
//	ИмяФайла = "";
//	
//	УниверсальныеМеханизмы.ПолучитьКаталогИИмяФайла(ПолноеИмяФайла, ИмяКаталога, ИмяФайла);
//	
//	СоздатьКаталогВСлучаеОтсутствия(ИмяКаталога);
//	
//КонецПроцедуры

// Процедура создает каталог если его нет
Процедура СоздатьКаталогВСлучаеОтсутствия(Знач ИмяКаталога)
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	НаличиеКаталогаОбмена = ПроверитьНаличиеКаталога(ИмяКаталога, Истина);
	
	Если НЕ НаличиеКаталогаОбмена Тогда
		// создаем вложенный каталог в темповый
		СоздатьКаталог(ИмяКаталога);
	КонецЕсли;
	
КонецПроцедуры


// функция проверяет наличие не пустого файла
функция ПроверитьНаличиеФайлаОбмена(Знач ИмяФайлаОбмена)
	
	// проверка наличия файла
	Файл = Новый Файл(ИмяФайлаОбмена);
	Если Не Файл.Существует() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если Файл.ЭтоКаталог() ИЛИ Файл.Размер() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// функция проверяет наличие каталога обмена
Функция ПроверитьНаличиеКаталога(Знач ИмяКаталога, Знач ПроверятьЧтоНайденныйФайлЭтоКаталог = Ложь) Экспорт
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	Если ПустаяСтрока(ИмяКаталога) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ВыбФайл = Новый Файл(ИмяКаталога);
	Если Не ВыбФайл.Существует() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроверятьЧтоНайденныйФайлЭтоКаталог Тогда
		// проверка что это точно каталог
		Возврат ВыбФайл.ЭтоКаталог();
	Иначе
		// если без разницы каталог это или нет
		Возврат Истина;
    КонецЕсли;
	
КонецФункции


Процедура ПоказатьПоНастройкеОбменаИнформациюОПравилах(НастройкиОбмена, ЭтоВыгрузкаИзТекущейИБ = Истина) Экспорт
	
	ИнформацияОПравилах = ПолучитьПоНастройкеОбменаИнформациюОПравилах(НастройкиОбмена, ЭтоВыгрузкаИзТекущейИБ);
	//999Предупреждение(ИнформацияОПравилах);
	
КонецПроцедуры

	  
// функция возвращает имя плана обмена по узлу обмена
Функция ПолучитьИмяПланаОбмена(УзелОбмена) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат "";
	КонецЕсли;
	
	МетаданныеУзла = УзелОбмена.Метаданные();
	Возврат МетаданныеУзла.Имя;
    	
КонецФункции

// функция возвращает узел текущей ИБ по узлу обмена
Функция ПолучитьТекущийУзелИБ(УзелОбмена) Экспорт
	
	ИмяПланаОбмена = ПолучитьИмяПланаОбмена(УзелОбмена);
	
	Если НЕ ЗначениеЗаполнено(ИмяПланаОбмена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();
	
КонецФункции


// функция архивирует файл
Функция ЗаархивироватьФайл2(ИмяИсходногоФайла,ИмяФайлаАрхива)
	
	Попытка
		Архиватор = Новый ЗаписьZipФайла(ИМяФайлаАрхива,, "Файл обмена данными");
		Архиватор.Добавить(ИмяИсходногоФайла);
		Архиватор.Записать();
		
		Сообщить1("Окончание сжатия файла обмена данными " + ИмяИсходногоФайла + "." + Символы.ПС +
			"Данные файла обмена помещены в файл " + ИмяФайлаАрхива);
	Исключение
		
		Сообщить1("Ошибка при сжатии данных файла обмена: " + ИмяИсходногоФайла + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;	
		
    КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// функция разархивирует файл
Функция РазархивироватьФайл2(ИмяФайлаЧтенияИзменений) 
	
	КаталогДляРаспаковки = КаталогВременныхФайлов();
	
	ИмяРазархивированногоФайла = "";
	
	Попытка
		
		Архиватор = Новый ЧтениеZipФайла(ИмяФайлаЧтенияИзменений);
		
		Если Архиватор.Элементы.Количество() > 0 Тогда
			
			Архиватор.Извлечь(Архиватор.Элементы[0], КаталогДляРаспаковки, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ИмяРазархивированногоФайла =""+Сокрлп(КаталогДляРаспаковки)+"\"+Архиватор.Элементы[0].Имя;
			
		Иначе
			
			ИмяРазархивированногоФайла = "";	
			
		КонецЕсли;

		Архиватор.Закрыть();
	
	Исключение
		
		Возврат "";
							
	КонецПопытки;
	
		Возврат ИмяРазархивированногоФайла;
	
КонецФункции 

// Процедура по адресу FTP обмена получает имя сервера и имя каталога обмена
Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога)
	
	АдресОбмена = НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
		
		
	Иначе
		
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			
			ИмяКаталога = ИмяКаталога + "/";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// функция проверяет наличие катаога на FTP сервере
Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.Имя  <> ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	Сообщить1("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера);
		
	Возврат Ложь;
	
КонецФункции

// функция проверяет настройки FTP подключения
Функция ПроверитьНастройкиFTPПодключения(ДанныеНастройки, ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина,
	ИмяКаталогаСервера = "", ИмяFTPСервера = "" , Соединение = Неопределено) Экспорт
	
	// нужно по полному имени получить имя сервера и имя каталога
	ПолучитьИмяСервераИИмяКаталогаОбмена(ДанныеНастройки.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	
	// если не задано имя сервера или каталога то невозможно обмениваться данными
	Если ПустаяСтрока(ИмяFTPСервера) Тогда
		
		Сообщить1("Не задан сервер обмена информацией через FTP.");

		Возврат Ложь;
		
	КонецЕсли;
	
	// соединение
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, ДанныеНастройки, ДанныеПротокола, ВывестиИнформациюВОкноСообщений);
	Если Соединение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// каталог проверяем
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера, ДанныеПротокола, ВывестиИнформациюВОкноСообщений);
	Если Не НаличиеКаталога Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


// СЛУЖЕБНЫЕ ФУНКЦИЯ ВЫПОЛНЯЮЩИЕСЯ ПЕРЕД ОБМЕНОМ
///////////////////////////////////////////////////////////////////////////////

// Процедура подготавливает обмен через файловый ресурс по настройке обмена данными
Процедура ПодготовитьОбменЧерезФайловыйРесурс(СтруктураНастроекОбменаДанными)
	//
	////Алгоритм получения файлов обмена:

	////Случай автоматического запуска обмена:
	////•	Проверка доступности указанного в настройках каталога. Если каталог не доступен (не найден), то обмен не начинается
	////•	Проверка наличия файла обмена от узла информационной базы
	////•	После внесений изменений в информационную базу файл обмена удаляется

	////Случай запуска обмена в ручном режиме:
	////•	Проверка доступности указанного в настройках каталога. 
	////o	Если искомый каталог доступен и файл обмена в нем присутствует, то обмен происходит точно так же как и при автоматическом запуске
	////o	Если каталог не доступен или не найден, либо не найден файл обмена данными то пользователю выдается соответствующее сообщение. Предлагается выбрать файл для обмена самостоятельно.
	//
	//ИтоговоеИмяФайлаОбменаДанными = "";
	//СтруктураНастроекОбменаДанными.КаталогПроведенияОбменаДанными = "";
	//
	//КаталогОбменаДанными = СтруктураНастроекОбменаДанными.ДанныеНастройки.КаталогОбменаИнформацией;
	//
	//ПроверкаНаличияКаталога = ПроверитьНаличиеКаталога(КаталогОбменаДанными, Истина);
	//Если НЕ ПроверкаНаличияКаталога Тогда
	//	
	//	// не задан каталог обмена данными
	//	Если ПустаяСтрока(КаталогОбменаДанными) Тогда
	//		ТекстСообщенияПользователю = "Не задан каталог обмена информацией";
	//	Иначе
	//		ТекстСообщенияПользователю = "Не найден каталог обмена информацией: " + КаталогОбменаДанными;
	//	КонецЕсли;
	//		
	//	РезультатВыбора = ОпроситьИмяКаталогаОбменаДанными(ТекстСообщенияПользователю, СтруктураНастроекОбменаДанными, 
	//		КаталогОбменаДанными);
	//		
	//	Если Не РезультатВыбора Тогда
	//		Возврат;
	//	КонецЕсли;
	//
	//КонецЕсли;	
	//	
	//// каталог есть, поверяем наличие файла обмена, если нужно данные считать
	//Если СтруктураНастроекОбменаДанными.ПроизводитьЧтениеДанных Тогда
	//	
	//	ИмяФайлаШаблонаОбмена = СформироватьИмяФайлаОбменаМеждуУзлами(СтруктураНастроекОбменаДанными.ДанныеНастройки.УзелИнформационнойБазы, СтруктураНастроекОбменаДанными.ТекущийУзелПланаОбмена, "");
	//	ИмяФайлаПоУмолчаниюXML = ИмяФайлаШаблонаОбмена + ".xml";
	//	ИмяФайлаПоУмолчаниюZIP = ИмяФайлаШаблонаОбмена + ".zip";
	//	
	//	ИтоговоеИмяФайлаОбменаДаннымиXML = УниверсальныеМеханизмы.ПолучитьИмяФайла(КаталогОбменаДанными, ИмяФайлаПоУмолчаниюXML);
	//	НаличиеФайлаОбменаXML = ПроверитьНаличиеФайлаОбмена(ИтоговоеИмяФайлаОбменаДаннымиXML);
	//			
	//	ИтоговоеИмяФайлаОбменаДаннымиZIP = УниверсальныеМеханизмы.ПолучитьИмяФайла(КаталогОбменаДанными, ИмяФайлаПоУмолчаниюZIP);
	//	НаличиеФайлаОбменаZIP = ПроверитьНаличиеФайлаОбмена(ИтоговоеИмяФайлаОбменаДаннымиZIP);
	//			
	//	Если НЕ НаличиеФайлаОбменаXML И НЕ НаличиеФайлаОбменаZIP Тогда
	//			
	//		// каталог есть, но файлов в нем, удовлетворяющих условиям поиска нет
	//		// значит просто файл не нашли, вот и все.
	//							
	//	ИначеЕсли НаличиеФайлаОбменаXML И НаличиеФайлаОбменаZIP Тогда
	//		// сразу оба файла...
	//		// берем последний по времени
	//		ВремяФайлаXML = УниверсальныеМеханизмы.ПолучитьДатуФайла(ИтоговоеИмяФайлаОбменаДаннымиXML);
	//		ВремяФайлаZIP = УниверсальныеМеханизмы.ПолучитьДатуФайла(ИтоговоеИмяФайлаОбменаДаннымиZIP);
	//				
	//		Если ВремяФайлаXML >= ВремяФайлаZIP Тогда
	//			ИтоговоеИмяФайлаОбменаДанными = ИтоговоеИмяФайлаОбменаДаннымиXML;	
	//		Иначе
	//			ИтоговоеИмяФайлаОбменаДанными = ИтоговоеИмяФайлаОбменаДаннымиZIP;
	//		КонецЕсли;
	//				
	//		// сообщаем о том с каким файлом ведется обмен		
	//		СообщитьИнформациюОбОбмене("В каталоге обмена имеются 2 файла обмена информацией: " + ИмяФайлаПоУмолчаниюXML + ", " + ИмяФайлаПоУмолчаниюXML, 
	//			СтруктураНастроекОбменаДанными);
	//		// то что выбрали для обмена
	//		СообщитьИнформациюОбОбмене("Время записи/изменения файла : " + ИтоговоеИмяФайлаОбменаДанными + " больше. Он выбран для обмена данными.", 
	//			СтруктураНастроекОбменаДанными);
	//				
	//	ИначеЕсли НаличиеФайлаОбменаXML Тогда	
	//		// есть только XML файл
	//		ИтоговоеИмяФайлаОбменаДанными = ИтоговоеИмяФайлаОбменаДаннымиXML; 
	//				
	//	ИначеЕсли НаличиеФайлаОбменаZIP Тогда	
	//		// есть только ZIP
	//		ИтоговоеИмяФайлаОбменаДанными = ИтоговоеИмяФайлаОбменаДаннымиZIP;
	//				
	//	КонецЕсли; // наличие файлов приема
	//			
	//КонецЕсли;	// производить прием сообщений
	//
	//// ничего не указано
	//Если ПустаяСтрока(ИтоговоеИмяФайлаОбменаДанными) 
	//	И ПустаяСтрока(КаталогОбменаДанными) Тогда
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	//
	//ИнициализироватьФормуХодаОбработки(СтруктураНастроекОбменаДанными, "Подготовка перед обменом данными", 5);
	//
	//// если задана переменная ИтоговоеИмяФайлаОбменаДанными тогда хотим и изменение получить и данные выгрузить
	//Если Не ПустаяСтрока(ИтоговоеИмяФайлаОбменаДанными) Тогда
	//	
	//	// получаем дату последнего файла обмена
	//	СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена = УниверсальныеМеханизмы.ПолучитьДатуФайла(ИтоговоеИмяФайлаОбменаДанными);
	//	СтруктураНастроекОбменаДанными.ИмяВходящегоФайлаОбмена = ИтоговоеИмяФайлаОбменаДанными; 
	//	
	//	// копируем файл во временный каталог
	//	СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений = ВерутьИмяВременногоФайлаЧтенияДанных(СтруктураНастроекОбменаДанными, 
	//		(Врег(ОбщегоНазначения.ПолучитьРасширениеФайла(ИтоговоеИмяФайлаОбменаДанными)) = "ZIP"));
	//							
	//	УдачноеКопирование = ВыполнитьКопированиеФайла(ИтоговоеИмяФайлаОбменаДанными, СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений, Истина, 
	//		СтруктураНастроекОбменаДанными, Ложь);
	//		
	//	Если Не УдачноеКопирование Тогда
	//		СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений	= "";			
	//	КонецЕсли;	
	//	
	//	ИмяФайла = "";
	//	УниверсальныеМеханизмы.ПолучитьКаталогИИмяФайла(ИтоговоеИмяФайлаОбменаДанными, КаталогОбменаДанными, ИмяФайла);
	//	
	//КонецЕсли;
	//
	//СтруктураНастроекОбменаДанными.НеобходимостьЗаписиОтветногоФайлаОбмена = СтруктураНастроекОбменаДанными.ПроизводитьЗаписьДанных;
	//
	//// весь обмен производим во временном каталоге
	//СтруктураНастроекОбменаДанными.КаталогПроведенияОбменаДанными = КаталогОбменаДанными; 
	//
КонецПроцедуры

 
// СЛУЖЕБНЫЕ ФУНКЦИЯ ВЫПОЛНЯЮЩИЕСЯ ПОСЛЕ ОБМЕНА
///////////////////////////////////////////////////////////////////////////////


//Функция по структуре возвращает была ли произведена запись данных
Функция ОпределитьБылаУдачнноПроизведенаЗаписьДанных(СтруктураНастроекОбменаДанными)
	
	Возврат СтруктураНастроекОбменаДанными.РезультатЗаписиДанных 
		И Не ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений);
	
КонецФункции

//Функция по структуре возвращает было ли произведено чтение данных
Функция ОпределитьБылоУдачноПроизведеноЧтениеДанных(СтруктураНастроекОбменаДанными)
	
	Возврат СтруктураНастроекОбменаДанными.РезультатЧтенияДанных 
		И Не ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений)
	
КонецФункции


// функция определяет нужно опправлять ответный пакет или нет
Функция ОпределитьНужноОптравлятьОтветныйПакет(СтруктураНастроекОбменаДанными, НужноПроверитьЧерезПочту)
	
	МаксимальныйДопустимыйРазмерСообщения = ?(НужноПроверитьЧерезПочту, СтруктураНастроекОбменаДанными.ДанныеНастройки.МаксимальныйРазмерОтправляемогоПакетаЧерезПочту, 
		СтруктураНастроекОбменаДанными.ДанныеНастройки.МаксимальныйРазмерОтправляемогоПолучаемогоПакетаЧерезFTP);
	
	// нужно предварительно проанализировать что бы размер отправляемого письма не превосходил ограничений
	Если МаксимальныйДопустимыйРазмерСообщения = 0 Тогда
		Возврат Истина;
	КонецЕсли;
			
	// ограничение на размер ответного письма есть, нужно сравнить это значение с размером отправляемого файла
	ФайлДляОправки = Новый Файл(СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений);
	Если ФайлДляОправки.Существует() Тогда
				
		РазмерОтправляемогоФайла = ФайлДляОправки.Размер();
				
		Если (РазмерОтправляемогоФайла / 1024) > МаксимальныйДопустимыйРазмерСообщения Тогда
					
			// файл превысил допустимый для отправки размер
			Сообщить1("Ответный пакет не был отправлен. Размер исходящего пакета составил: " + Окр(РазмерОтправляемогоФайла / 1024, 2) + 
				" (КБт) что превышает допустимое ограничение " + МаксимальныйДопустимыйРазмерСообщения + " (КБт)");
				
			Возврат Ложь;	
					
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

  
// Процедура корректирует паузу перед запуском регламентного задания
Процедура ИзменитьВремяПаузыПовтораРегламентногоЗадания(СтруктураНастроекОбменаДанными)

	// изменяем время только при автообмене
	Если СтруктураНастроекОбменаДанными.РучнойРежимЗапуска
		ИЛИ НЕ СтруктураНастроекОбменаДанными.ДанныеНастройки.ДинамическиИзменятьИнтервалМеждуОбменами Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТекущееРегламентноеЗадание = СтруктураНастроекОбменаДанными.ДанныеНастройки.НайтиРегламентноеЗаданиеПоНастройке();
	Исключение
		Возврат;
	КонецПопытки;

	Если ТекущееРегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = ТекущееРегламентноеЗадание.Расписание;
	
	Если РасписаниеРегламентногоЗадания.ПериодПовтораВТечениеДня = 0 Тогда
		Возврат;
	КонецЕсли;

	ДатаНачалаПоследнегоОбмена = Неопределено;
	Если ОпределитьБылоУдачноПроизведеноЧтениеДанных(СтруктураНастроекОбменаДанными) Тогда
		ДатаНачалаПоследнегоОбмена = СтруктураНастроекОбменаДанными.ДатаПоследнейЗагрузки;
	ИначеЕсли ОпределитьБылаУдачнноПроизведенаЗаписьДанных(СтруктураНастроекОбменаДанными) Тогда
		ДатаНачалаПоследнегоОбмена = СтруктураНастроекОбменаДанными.ДатаПоследнейВыгрузки;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПоследнегоОбмена) Тогда
		ДатаНачалаПоследнегоОбмена = СтруктураНастроекОбменаДанными.ДатаПоследнегоОбмена;
	КонецЕсли;

	ПродолжительностьПоследнегоОбмена = ТекущаяДата() - ДатаНачалаПоследнегоОбмена;
	
	НовоеЗначениеПаузыПовтора = ПродолжительностьПоследнегоОбмена + Окр(РасписаниеРегламентногоЗадания.ПериодПовтораВТечениеДня / 2, 0);
	
	РасписаниеРегламентногоЗадания.ПаузаПовтора = НовоеЗначениеПаузыПовтора;
	
	Попытка
		ТекущееРегламентноеЗадание.Записать();
	Исключение
	КонецПопытки;

КонецПроцедуры

// Процедура возвращает параметры для обмена
Процедура ПолучитьПараметрыОбменаДанными(СтруктураНастроекОбменаДанными, МетаданныеУзлаОбмена, СтрокаИнформацияОбОбмене)
	
	// получаем узел информационной базы плана обмена
	ИмяПланаОбмена = ПолучитьИмяПланаОбмена(СтруктураНастроекОбменаДанными.ДанныеНастройки.УзелИнформационнойБазы);
	МетаданныеУзлаОбмена = СтруктураНастроекОбменаДанными.ДанныеНастройки.УзелИнформационнойБазы.Метаданные();
	
	СтрокаОписанияЗапуска = ?(СтруктураНастроекОбменаДанными.РучнойРежимЗапуска, "в интерактивном режиме", "в автоматическом режиме");
	СтрокаИнформацияОбОбмене = "обмена данными " + СтрокаОписанияЗапуска + " для плана обмена """ + ИмяПланаОбмена + """ узла """ + СтруктураНастроекОбменаДанными.ДанныеНастройки.УзелИнформационнойБазы.Наименование + """";
	
КонецПроцедуры

Процедура ПроверитьРежимВыполненияОбменаДанными(СтруктураНастроекОбменаДанными)
	
	Попытка
		
		НуженУстановитьФоновыйРежим  = Ложь;
		НаличиеВыгрузокИлиЗагрузок = Ложь;
		
		Если ЗначениеЗаполнено(СтруктураНастроекОбменаДанными.ДатаПоследнейЗагрузки)
			И НЕ ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений)
			И СтруктураНастроекОбменаДанными.РезультатЧтенияДанных Тогда
			
			НуженУстановитьФоновыйРежим = (СтруктураНастроекОбменаДанными.ПереданоОбъектовФоновогоОбмена > 0);
			НаличиеВыгрузокИлиЗагрузок = Истина;
						
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураНастроекОбменаДанными.ДатаПоследнейВыгрузки)
			И НЕ ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений)
			И СтруктураНастроекОбменаДанными.РезультатЗаписиДанных Тогда
			
			НуженУстановитьФоновыйРежим = НуженУстановитьФоновыйРежим ИЛИ (СтруктураНастроекОбменаДанными.ПолученоОбъектовФоновогоОбмена > 0);
			НаличиеВыгрузокИлиЗагрузок = Истина;
			
		КонецЕсли;
		
		Если Не НаличиеВыгрузокИлиЗагрузок Тогда
			Возврат;
		КонецЕсли;
		
		// посмотрим есть ли
		СтруктураНастроекОбменаДанными.ДанныеНастройки.УстановитьРежимРегламетныхЗадач(НуженУстановитьФоновыйРежим);
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры


Процедура ВыполнитьОбычныйОбменДанными(СтруктураНастроекОбменаДанными)
	
	//Если СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезФайловыйРесурс Тогда
	//			
	//	СтруктураНастроекОбменаДанными.Вставить("КаталогПроведенияОбменаДанными", "");
	//	СтруктураНастроекОбменаДанными.Вставить("ИмяВходящегоФайлаОбмена", "");
	//	ПодготовитьОбменЧерезФайловыйРесурс(СтруктураНастроекОбменаДанными);
	//	
	//ИначеЕсли СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезFTPРесурс Тогда
	//	
	//	СтруктураНастроекОбменаДанными.Вставить("ИмяВходящегоФайлаОбмена", "");
	//	ПодготовитьОбменЧерезFTPРесурс(СтруктураНастроекОбменаДанными);
	//	
	//ИначеЕсли СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезПочту Тогда
	//	
	//	СтруктураНастроекОбменаДанными.Вставить("МассивОбработанныхПисем", Новый Массив());
	//	ПодготовитьОбменЧерезПочтовыйРесурс(СтруктураНастроекОбменаДанными);
	//	
	//КонецЕсли;
	//
	//// файл для записи изменений
	//Если СтруктураНастроекОбменаДанными.НеобходимостьЗаписиОтветногоФайлаОбмена Тогда 
	//	
	//	СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений = ВерутьИмяВременногоФайлаЗаписиДанных(СтруктураНастроекОбменаДанными);
	//	
	//	Если СтруктураНастроекОбменаДанными.ДанныеНастройки.ВыполнятьАрхивациюФайловОбмена Тогда
	//		
	//		УниверсальныеМеханизмы.УстановитьРасширениеФайла(СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений, ".zip");
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//// если ничего делать не надо, то выходим вообще
	//Если ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений)
	//	И ПустаяСтрока(СтруктураНастроекОбменаДанными.ИмяФайлаЗаписиИзменений) Тогда
	//	
	//	СообщитьИнформациюОбОбмене("Ни загрузка ни выгрузка данных не были произведены", СтруктураНастроекОбменаДанными);
	//	ЗакрытьФормуОбработкиДанных(СтруктураНастроекОбменаДанными);
	//	ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбменаДанными);
	//	Возврат;
	//	
	//КонецЕсли;
	//			
	//// САМ ОБМЕН ДАННЫМИ
	//ВыполнитьЗагрузкуДанныхИзФайлаОбмена(СтруктураНастроекОбменаДанными);
	//ВыполнитьВыгрузкуДанныхВФайлОбмена(СтруктураНастроекОбменаДанными);
	//						
	//// ДЕЙСТВИЯ ПОСЛЕ ОБМЕНА
	//Если СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезФайловыйРесурс Тогда
	//		
	//	ДействияПослеОбменаЧерезФайловыйРесурс(СтруктураНастроекОбменаДанными);
	//			
	//ИначеЕсли СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезFTPРесурс Тогда
	//		
	//	ДействияПослеОбменаЧерезFTPРесурс(СтруктураНастроекОбменаДанными);
	//		
	//ИначеЕсли СтруктураНастроекОбменаДанными.ДанныеНастройки.ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезПочту Тогда
	//		
	//	ДействияПослеОбменаЧерезПочтовыйРесурс(СтруктураНастроекОбменаДанными);
	//		
	//КонецЕсли;
	//
	//Если Не СтруктураНастроекОбменаДанными.РучнойРежимЗапуска
	//	И СтруктураНастроекОбменаДанными.ДоступностьФайла = Истина Тогда
	//	
	//	// нет ли обновления конфигурации по РИБ
	//	КонфигурацияПриОбменеРИБИзменена = Ложь;
	//	СтруктураНастроекОбменаДанными.Свойство("КонфигурацияПриОбменеРИБИзменена", КонфигурацияПриОбменеРИБИзменена);
	//	
	//	Если КонфигурацияПриОбменеРИБИзменена = Неопределено
	//		ИЛИ КонфигурацияПриОбменеРИБИзменена = Ложь Тогда
	//		
	//		ВыполнитьУдалениеФайла(СтруктураНастроекОбменаДанными.ВыполнятьОбменПриПоявленииФайла, СтруктураНастроекОбменаДанными, , Истина);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

    
Процедура задатьнастройки(КодУзла=Неопределено)
	
//ТАБЛИЦА ПАРАМЕТРОВ ВЫГРУЗКИ	
ТаблицаПараметров= Новый ТаблицаЗначений;
ТаблицаПараметров.Колонки.Добавить("Имя");
ТаблицаПараметров.Колонки.Добавить("Значение");

нов=ТаблицаПараметров.добавить();
нов.имя="ВсеТовары";
нов.значение=ВсеТовары;

нов=ТаблицаПараметров.добавить();
нов.имя="ГруппаНоменклатуры";

//9999 нов.значение=ВыбНом;
нов.значение=Справочники.Номенклатура.ПустаяСсылка();

нов=ТаблицаПараметров.добавить();
нов.имя="ГруппаКонтрагентов";

//9999 нов.значение=ВыбКон;

нов.значение=справочники.Контрагенты.ПустаяСсылка();

новзначение="";
для каждого стр из узлы цикл
новзначение=новзначение+стр.Узел.Код+",";
Конеццикла;
нов=ТаблицаПараметров.добавить(); 
нов.имя="КодУзла";
нов.значение=новзначение;

новзначение="";
для каждого стр из Склады цикл
новзначение=новзначение+стр.Склад.Код+",";
Конеццикла;
нов=ТаблицаПараметров.добавить();
нов.имя="КодСклада";
нов.значение=новзначение;


НастройкиОбмена= Новый ТаблицаЗначений;
НастройкиОбмена.Колонки.Добавить("ПортFTPСоединения");
НастройкиОбмена.Колонки.Добавить("ПользовательFTPСоединения");
НастройкиОбмена.Колонки.Добавить("ПарольFTPСоединения");
НастройкиОбмена.Колонки.Добавить("ПассивноеFTPСоединение");
НастройкиОбмена.Колонки.Добавить("ПользовательПроксиFTP");
НастройкиОбмена.Колонки.Добавить("ПротоколПроксиFTP");
НастройкиОбмена.Колонки.Добавить("СерверПроксиFTP");
НастройкиОбмена.Колонки.Добавить("СерверFTP");
НастройкиОбмена.Колонки.Добавить("КаталогFTP");
НастройкиОбмена.Колонки.Добавить("ТекстПравил");
НастройкиОбмена.Колонки.Добавить("ИмяФайлаЗаписиИзменений");
НастройкиОбмена.Колонки.Добавить("ИмяФайлаЧтенияИзменений");
НастройкиОбмена.Колонки.Добавить("ПроизводитьЧтениеДанных");
НастройкиОбмена.Колонки.Добавить("ПроизводитьЗаписьДанных"); 
НастройкиОбмена.Колонки.Добавить("ТаблицаПараметров"); 

// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
//ПользовательFTP="*%*%*%";
//ПарольFTP="*$*$*$";
ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPСклада).Логин;
ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPСклада).Пароль;
// Ихсанов Д. А. Конец  14.10.2025
КаталогFTP="snl";
//крохин начало 05.12.2017
//СерверFTP="87.236.190.180:21";
//крохин начало 06.10.2020
//СерверFTP="188.65.108.67";
СерверFTP= "87.239.110.105";
//крохин конец 06.10.2020
//крохин конец 05.12.2017

нов=НастройкиОбмена.Добавить();
нов.ПортFTPСоединения=21;
нов.серверFTP=СерверFTP;
нов.ПарольFTPСоединения=ПарольFTP;
нов.ПользовательFTPСоединения=ПользовательFTP;
нов.КаталогFTP=Сокрлп(КаталогFTP);
Нов.таблицаПараметров=ТаблицаПараметров;
нов.ИмяФайлаЧтенияИзменений="Zakaz";
если всетовары тогда
нов.ИмяФайлаЗаписиИзменений="Tov_"+Сокрлп(узлы[0].Узел.код);
иначе
нов.ИмяФайлаЗаписиИзменений="Out_"+Сокрлп(узлы[0].Узел.код);
Конецесли;
МакетПравилВыгрузки= ПолучитьМакет("ПравилаВыгрузки");

нов.ПроизводитьЧтениеДанных=ИСТИНА;
нов.ПроизводитьЗаписьДанных=ИСТИНА;
Нов.текстправил=МакетПравилВыгрузки.ПолучитьТекст();

стрнастроек=настройкиобмена[0];

ОбработкаОбменаДаннымиXML = Обработки.УниверсальныйОбменДаннымиXML1.Создать();

Соединение=ВыполнитьFTPПодключениеКСерверу(СтрНастроек.СерверFTP,Стрнастроек);

	Если Соединение= Неопределено тогда 
		сообщить1("Невозможно соединиться с сервером!");
	    Возврат;	
    Конецесли;  	

    Если ПроверитьНаличиеКаталогаНаFTPСервере(Соединение,КаталогFTP) тогда 
	    Соединение.УстановитьТекущийКаталог(СтрНастроек.КаталогFTP);
	Конецесли;	

Конецпроцедуры

			
		 
//// Процедура подготавливает обмен через FTP ресурс по настройке обмена данными
//Процедура ПодготовитьОбменЧерезFTPРесурс(СтруктураНастроекОбменаДанными)
//	
//	Если СтруктураНастроекОбменаДанными.ПроизводитьЧтениеДанных Тогда
//		
//		МассивНайденныхФайлов = Соединение.НайтиФайлы(СтруктураНастроекОбменаДанными.ИмяКаталогаСервера, СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений);
//						
//		Для Каждого ФайлФТП Из МассивНайденныхФайлов Цикл
//			
//			ТекущийФайлДляОбмена = ФайлФТП;
//			
//			// проверяем нужное расширение, то что это фай а не каталог, запоминаем последнюю дату файла
//			Если НЕ( (Врег(ТекущийФайлДляОбмена.Расширение) = ".ZIP") ИЛИ (Врег(ТекущийФайлДляОбмена.Расширение) = ".XML") ) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если (ТекущийФайлДляОбмена.ЭтоФайл() = Ложь) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если (ТекущийФайлДляОбмена.Размер() = 0) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			// с датами определяемся
//			ВремяИзмененияТекущегоФайла = ТекущийФайлДляОбмена.ПолучитьВремяИзменения();
//			
//			//дата последнего файла обмена должна быть меньше текущего файла обмена
//			//Если (СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена <> Неопределено) 
//			//	И (СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена > ВремяИзмененияТекущегоФайла) Тогда
//			//	
//			//	Продолжить;
//			//	
//			//КонецЕсли;			
//			
//			// проверим что бы размер файла не превосходил ограничения по размеру
//			//Если (СтруктураНастроекОбменаДанными.ДанныеНастройки.МаксимальныйРазмерОтправляемогоПолучаемогоПакетаЧерезFTP > 0) 
//			//	И (ТекущийФайлДляОбмена.Размер() / 1024) > СтруктураНастроекОбменаДанными.ДанныеНастройки.МаксимальныйРазмерОтправляемогоПолучаемогоПакетаЧерезFTP Тогда
//			//	
//			//	// файл не удовлетфоряет ограничениям по размеру для получения через FTP
//			//	Продолжить;	
//			//			
//			//КонецЕсли;			
//			
//			ФайлДляОбмена = ТекущийФайлДляОбмена;
//			СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена = ВремяИзмененияТекущегоФайла; 
//			СтруктураНастроекОбменаДанными.ИмяВходящегоФайлаОбмена = ИмяFTPСервера + ФайлФТП.ПолноеИмя;
//			
//			//Перетащим файлы для чтения в каталог
//			
//		КонецЦикла;	
//			
//		//надо переместить нужный файл в каталог для обмена данными
//		Если ФайлДляОбмена <> Неопределено Тогда
//			
//			СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений = ВерутьИмяВременногоФайлаЧтенияДанных(СтруктураНастроекОбменаДанными, 
//				(Врег(ФайлДляОбмена.Расширение) = ".ZIP"));
//			
//			Попытка
//				// генерируем имя файла для чтения изменений и закачиваем этот файл
//				Соединение.Получить(ФайлДляОбмена.ПолноеИмя, СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений);	
//				
//			Исключение
//			
//				СообщитьИнформациюОбОшибкеОбмена("Ошибка при копировании файла c FTP ресурса: " + ОписаниеОшибки(), 
//					СтруктураНастроекОбменаДанными, Истина, Ложь);
//				СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений = "";
//							
//			КонецПопытки;
//				
//		Иначе
//			
//			Если (МассивНайденныхФайлов.Количество() > 0)
//				И ЗначениеЗаполнено(СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена) Тогда
//				
//				//файлы то есть но ни один не подходит
//				СообщениеДляПользователя = "Возможно дата файлов обмена не превосходит дату последнего файла обмена данными через FTP: " + Строка(СтруктураНастроекОбменаДанными.ДатаПоследнегоФайлаОбмена);
//				
//				СообщитьИнформациюОбОбмене(СообщениеДляПользователя, СтруктураНастроекОбменаДанными);
//				ДополнитьКомментарийДляОперации(СтруктураНастроекОбменаДанными, СообщениеДляПользователя, Ложь);				
//								
//			КонецЕсли;
//			
//			СтруктураНастроекОбменаДанными.ИмяФайлаЧтенияИзменений = "";		
//		КонецЕсли;
//		
//	КонецЕсли; // надо читать данные с FTP	
//	
//	
//КонецПроцедуры
